EX03: PROC OPTIONS (MAIN);                                                                DCL A DECIMAL FIXED;                                                            DCL B DECIMAL FIXED;                                                            DCL C DECIMAL FIXED INIT ( 4 );                                                 DCL D DECIMAL FIXED;                                                            A = 2;                                                                                                                                                                                                                              GO TO L2;                                                                                                                                             L1:       D = A + B;                                                                                                                                               GO TO L3;                                                                                                                                              L2:       B = 3;                                                                                                                                                   GO TO L1;                                                                                                                                              L3:       D = D - C;                                                                  END EX03;                                                                 
